app/views/recipes/show.html.haml

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = 4
---
  %tbody
    - @recipe.ingredients.each do |i|

SELECT "foods".* FROM "foods" WHERE "foods"."id" = 3 LIMIT 1
---
      %td
        = @recipe.food.protein * @recipe.size / 100