app/controllers/daily_food_records_controller.rb

SELECT "daily_food_records".* FROM "daily_food_records"
---
  def index
    @daily_food_records = DailyFoodRecord.all

SELECT "daily_food_records".* FROM "daily_food_records" WHERE "daily_food_records"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def show
    @daily_food_record = DailyFoodRecord.find(params[:id])
    @user = User.find(params[:user_id])