app/controllers/meals_controller.rb

  def index
    @meals = Meal.all
---
SELECT "meals".* FROM "meals"

  def show
    @meal = Meal.find(params[:id])
---
SELECT "meals".* FROM "meals" WHERE "meals"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @meal = Meal.new(params[:meal])
    @user = User.find(params[:user_id])
    @dfr = DailyFoodRecord.find(params[:daily_food_record_id])
    @dfr.meals << @meal
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "daily_food_records".* FROM "daily_food_records" WHERE "daily_food_records"."id" = 11 LIMIT 1
INSERT INTO "daily_food_records" ("created_at", "food_id", "size", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 19 Jun 2013 13:25:28 UTC +00:00], ["food_id", nil], ["size", nil], ["updated_at", Wed, 19 Jun 2013 13:25:28 UTC +00:00], ["user_id", 1]]
INSERT INTO "foods" ("carbohydrate", "consumable_id", "consumable_type", "created_at", "energy", "fat", "name", "protein", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "meals" ("created_at", "daily_food_record_id", "description", "name", "time", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)