app/controllers/products_controller.rb

INSERT INTO "foods" ("carbohydrate", "consumable_id", "consumable_type", "created_at", "energy", "fat", "name", "protein", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "products" ("calories", "carbohydrate", "created_at", "fat", "is_verified", "manufacturer", "name", "protein", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @product = Product.new(params[:product])
    @product.food.user = current_user
    respond_to do |format|
      if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "products" SET "protein" = NULL, "carbohydrate" = NULL, "fat" = NULL, "calories" = NULL, "updated_at" = '2013-04-01 15:19:24.588100' WHERE "products"."id" = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])