app/controllers/recipes_controller.rb

  def create
    @recipe = Recipe.new(params[:recipe])
    @recipe.food.user = current_user
    #@recipe.fill_total
    respond_to do |format|
      if @recipe.save
---
INSERT INTO "foods" ("carbohydrate", "consumable_id", "consumable_type", "created_at", "energy", "fat", "name", "protein", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "recipes" ("description") VALUES (?)  [["description", "Banana with milk in 1:5 proportion"]]